---
title: PipeFittingAndAccessoryPressureDropData
classe: Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryPressureDropData
namespace: Autodesk.Revit.DB.Plumbing
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# PipeFittingAndAccessoryPressureDropData

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Int32 CalculationType { get; }` | `pipeFittingAndAccessoryPressureDropData.CalculationType` | Int32 |
| `Boolean IsCurrentEntityValid { get; set; }` | `pipeFittingAndAccessoryPressureDropData.IsCurrentEntityValid` | Boolean |
| `Boolean IsValidObject { get; }` | `pipeFittingAndAccessoryPressureDropData.IsValidObject` | Boolean |
| `Void Dispose()` | `pipeFittingAndAccessoryPressureDropData.Dispose()` | Void |
| `PipeFittingAndAccessoryData GetPipeFittingAndAccessoryData()` | `pipeFittingAndAccessoryPressureDropData.GetPipeFittingAndAccessoryData()` | PipeFittingAndAccessoryData |
| `IList<PipeFittingAndAccessoryPressureDropItem> GetPresureDropItems()` | `pipeFittingAndAccessoryPressureDropData.GetPresureDropItems()` | IList<PipeFittingAndAccessoryPressureDropItem> |
| `Void SetDefaultEntity(Entity)` | `pipeFittingAndAccessoryPressureDropData.SetDefaultEntity(defaultEntity)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```